1yib.rust-bundle
42crunch.vscode-openapi
aaron-bond.better-comments
adamhartford.vscode-base64
alexcvzz.vscode-sqlite
anseki.vscode-color
antfu.file-nesting
antfu.goto-alias
antfu.iconify
antfu.icons-carbon
antfu.open-in-github-button
antfu.pnpm-catalog-lens
antfu.slidev
antfu.theme-vitesse
antfu.unocss
anthropic.claude-code
aws-scripting-guy.cform
belfz.search-crates-io
bierner.markdown-mermaid
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
castwide.solargraph
chakrounanas.turbo-console-log
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cpylua.language-postcss
csstools.postcss
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
dotjoshjohnson.xml
drcika.apc-extension
dsznajder.es7-react-js-snippets
dunstontc.viml
dustypomerleau.rust-syntax
eamodio.gitlens
editorconfig.editorconfig
eliostruyf.vscode-typescript-exportallmodules
esbenp.prettier-vscode
fabiospampinato.vscode-open-in-github
figma.figma-vscode-extension
formulahendry.code-runner
fosshaas.fontsize-shortcuts
foxundermoon.shell-format
fwcd.kotlin
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.geminicodeassist
grafana.vscode-jsonnet
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.hcl
hbenl.vscode-test-explorer
hediet.vscode-drawio
humao.rest-client
ibm.output-colorizer
inu1255.easy-snippet
jannisx11.batch-rename-extension
jasonnutter.search-node-modules
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jock.svg
johnsoncodehk.vscode-tsconfig-helper
josetr.cmake-language-support-vscode
kaiwood.endwise
kisstkondoros.vscode-gutter-preview
kokororin.vscode-phpfmt
kumar-harsh.graphql-for-vscode
lokalise.i18n-ally
mamodom.package-json-dependencies-navigation
meganrogge.template-string-converter
mikestead.dotenv
mirone.milkdown
mkxml.vscode-filesize
mongodb.mongodb-vscode
mpontus.tab-cycle
mrmlnc.vscode-json5
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-ossdata.vscode-pgsql
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
nhoizey.gremlins
nuxt.mdc
opentofu.vscode-opentofu
peterschmalfeldt.explorer-exclude
pkief.material-icon-theme
platformio.platformio-ide
pnp.polacode
prisma.prisma
quicktype.quicktype
rangav.vscode-thunder-client
redhat.java
redhat.vscode-yaml
redocly.openapi-vs-code
rust-lang.rust-analyzer
saoudrizwan.claude-dev
shanoor.vscode-nginx
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
skyapps.fish-vscode
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
stylelint.vscode-stylelint
svelte.svelte-vscode
syler.sass-indented
sysoev.language-stylus
tamasfe.even-better-toml
tim-koehler.helm-intellisense
tomoki1207.pdf
twxs.cmake
tyriar.sort-lines
unifiedjs.vscode-mdx
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vitest.explorer
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscodevim.vim
vue.volar
wakatime.vscode-wakatime
wayou.vscode-todo-highlight
wheatjs.vueuse
xabikos.javascriptsnippets
xaver.clang-format
xdebug.php-debug
yoavbls.pretty-ts-errors
yzane.markdown-pdf
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zxh404.vscode-proto3
